## Pandas Demo

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 文件读写 I/O

In [2]:
df = pd.read_csv('./data/ad_feature.csv', sep=',', header=0)    # 读入数据

In [3]:
df.shape

(846811, 6)

In [4]:
df.columns

Index(['adgroup_id', 'cate_id', 'campaign_id', 'customer', 'brand', 'price'], dtype='object')

In [5]:
df.head(10)

   adgroup_id  cate_id  campaign_id  customer     brand   price
0       63133     6406        83237         1   95471.0  170.00
1      313401     6406        83237         1   87331.0  199.00
2      248909      392        83237         1   32233.0   38.00
3      208458      392        83237         1  174374.0  139.00
4      110847     7211       135256         2  145952.0   32.99
5      607788     6261       387991         6  207800.0  199.00
6      375706     4520       387991         6       NaN   99.00
7       11115     7213       139747         9  186847.0   33.00
8       24484     7207       139744         9  186847.0   19.00
9       28589     5953       395195        13       NaN  428.00

In [6]:
df[:100].to_csv('./data/output.csv', index=False)    # 输出成CSV格式，索引（index）不要输出

In [7]:
df[:100].to_html('./data/output.html', index=False)    # 输出成网页table

In [8]:
writer = pd.ExcelWriter('./data/output.xlsx')    # 输出到Excel文件
df[:100].to_excel(writer, 'Sheet1', index=False)
df[100:200].to_excel(writer, 'Sheet2', index=False)
writer.save()

### 基本操作 Essential Basic Functionality

In [9]:
df.head(10)    # 前十行

   adgroup_id  cate_id  campaign_id  customer     brand   price
0       63133     6406        83237         1   95471.0  170.00
1      313401     6406        83237         1   87331.0  199.00
2      248909      392        83237         1   32233.0   38.00
3      208458      392        83237         1  174374.0  139.00
4      110847     7211       135256         2  145952.0   32.99
5      607788     6261       387991         6  207800.0  199.00
6      375706     4520       387991         6       NaN   99.00
7       11115     7213       139747         9  186847.0   33.00
8       24484     7207       139744         9  186847.0   19.00
9       28589     5953       395195        13       NaN  428.00

In [10]:
df.tail(10)    # 倒数十行

        adgroup_id  cate_id  campaign_id  customer     brand  price
846801      841089     5271       378762    255848       NaN   75.0
846802      828175     8116       374639    255851  430861.0  376.0
846803      831181     7600       377541    255862  122355.0  260.0
846804      762452     4284       379172    255865       NaN  128.0
846805      762200     4284       379172    255865       NaN  169.0
846806      824255     4526       380022    255868  389713.0  268.0
846807      790170     4280       379736    255872  322171.0   68.0
846808      845286     6261       379736    255872  322171.0   88.0
846809      824732     4520       379736    255872  322171.0   68.0
846810      845337    11156       379603    255874   74120.0  279.0

In [11]:
df['price'].describe()    # 一列的统计信息，只对于可以比较大小的值有意义

count    8.468110e+05
mean     1.838867e+03
std      3.108877e+05
min      1.000000e-02
25%      4.900000e+01
50%      1.390000e+02
75%      3.520000e+02
max      1.000000e+08
Name: price, dtype: float64

In [12]:
df['cate_id'].describe()    # 类别，无意义

count    846811.000000
mean       5868.593464
std        2705.171203
min           1.000000
25%        4383.000000
50%        6183.000000
75%        7047.000000
max       12960.000000
Name: cate_id, dtype: float64

In [13]:
# 迭代 Iteration, 一般用不到, 用于精细调整数据
for row in df[:10].itertuples():
    print(row.cate_id, row.price)

6406 170.0
6406 199.0
392 38.0
392 139.0
7211 32.99
6261 199.0
4520 99.0
7213 33.0
7207 19.0
5953 428.0

In [14]:
# 排序 Sort
df[:10].sort_values(by='price')    # 按照价格从高到低排序

   adgroup_id  cate_id  campaign_id  customer     brand   price
8       24484     7207       139744         9  186847.0   19.00
4      110847     7211       135256         2  145952.0   32.99
7       11115     7213       139747         9  186847.0   33.00
2      248909      392        83237         1   32233.0   38.00
6      375706     4520       387991         6       NaN   99.00
3      208458      392        83237         1  174374.0  139.00
0       63133     6406        83237         1   95471.0  170.00
1      313401     6406        83237         1   87331.0  199.00
5      607788     6261       387991         6  207800.0  199.00
9       28589     5953       395195        13       NaN  428.00

In [15]:
df[:10].sort_values(by=['price', 'brand'], ascending=False)     # 可以按照多个key进行排序

   adgroup_id  cate_id  campaign_id  customer     brand   price
9       28589     5953       395195        13       NaN  428.00
5      607788     6261       387991         6  207800.0  199.00
1      313401     6406        83237         1   87331.0  199.00
0       63133     6406        83237         1   95471.0  170.00
3      208458      392        83237         1  174374.0  139.00
6      375706     4520       387991         6       NaN   99.00
2      248909      392        83237         1   32233.0   38.00
7       11115     7213       139747         9  186847.0   33.00
4      110847     7211       135256         2  145952.0   32.99
8       24484     7207       139744         9  186847.0   19.00

In [16]:
df[(df['price'] > 1000) & (df['price'] <= 1005)]    # 按条件选取

        adgroup_id  cate_id  campaign_id  customer     brand    price
15532       162225      438       195767     10304   27548.0  1003.20
15629       198226     1137       132021     10304   27548.0  1003.95
63708       493633     6529        24297     43846   65862.0  1005.00
95975        70894     6143       415904     70491   57921.0  1001.00
141950      146094     6422       202221    110338  383342.0  1001.00
170936       56930      438        63192    135753  236763.0  1001.00
249594      131736     7548       239667    218706       NaN  1004.00
269105      731301     6300       321125    241392  449625.0  1001.00
381495       95726      438        15319     69075  198458.0  1004.00
387720      520899    10061       196687     74656  121466.0  1004.00
387729      217219    10061       196687     74656  121466.0  1004.00
426948      740358      685        37953    111752       NaN  1001.00
446511      356429     6261       244039    129461  291007.0  1001.00
466898      502035     6261        76193    146324  348841.0  1003.00
644946      778184     4282        64922     55566       NaN  1001.00
655803      279547     4290       409222     64015  109551.0  1002.00
808370      202848     1535       211527    208644   33413.0  1001.00

### 数据分组 Groupby

In [41]:
df = pd.read_csv('./data/ad_feature.csv', sep=',', header=0, nrows=1000)
cate_group = df.groupby(['cate_id', 'customer'])    # 按照cate_id进行分组，把cate_id相同的数据分成一组
type(cate_group)

pandas.core.groupby.generic.DataFrameGroupBy

In [42]:
cate_group.size()

cate_id  customer
12       63           3
         369          1
45       340          3
122      225          3
         658          2
124      76           1
         325          3
133      339          1
161      376          7
231      114          1
286      114          1
303      632          2
311      655          1
317      92           1
392      1            2
549      139          2
562      715          1
565      83           3
591      607          2
619      414          1
648      654          1
649      301          1
830      171          1
856      225         14
         407          2
         675          1
883      632          9
912      325          7
         720          2
917      15           1
                     ..
10536    574          4
10564    117          2
10673    104          1
10675    497          2
10682    497          1
10701    172          1
10758    716          4
10765    326          1
10851    210          1
10885    72           2
10956    24           1
10979    585          1
10982    585          1
11017    165          8
11089    674          1
11156    173          2
11186    112          1
11292    455          1
11467    676         18
11586    334          2
11715    96           1
11718    96           1
11740    76           1
11749    210          1
11780    720          1
11932    196          1
12115    516          1
12159    112          1
12390    130          3
12845    323          1
Length: 472, dtype: int64

In [19]:
cate_group['price', 'brand'].mean().head()   # 计算每一组price和brand的平均值，必须保证函数在每个组中产生一个值

              price     brand
cate_id
12       374.000000   97165.0
45        62.666667  141605.0
122       28.800000  386513.0
124       89.000000  100353.0
133        2.000000       NaN

In [40]:
df.groupby('cate_id')['brand'].mean().reset_index(drop=False).head()    # reset_index会重新设置index，drop参数控制是否丢弃原来的index

   cate_id     brand
0       12   97165.0
1       45  141605.0
2      122  386513.0
3      124  100353.0
4      133       NaN

### 数据合并（Merge, Concatenate）

In [21]:
df = pd.read_csv('./data/ad_feature.csv', sep=',', header=0)
df1 = df[['adgroup_id', 'price']]
df2 = df[['adgroup_id', 'cate_id', 'brand']]

In [22]:
df1.head()

   adgroup_id   price
0       63133  170.00
1      313401  199.00
2      248909   38.00
3      208458  139.00
4      110847   32.99

In [23]:
df2.head()

   adgroup_id  cate_id     brand
0       63133     6406   95471.0
1      313401     6406   87331.0
2      248909      392   32233.0
3      208458      392  174374.0
4      110847     7211  145952.0

In [24]:
df3 = pd.merge(df1, df2, on='adgroup_id', how='inner')     # 把adgroup_id相同的数据拼接
df3.head()

   adgroup_id   price  cate_id     brand
0       63133  170.00     6406   95471.0
1      313401  199.00     6406   87331.0
2      248909   38.00      392   32233.0
3      208458  139.00      392  174374.0
4      110847   32.99     7211  145952.0

In [25]:
pd.concat([df[:4], df[10:15]], axis=0)    # 按照axis轴进行拼接，axis=0在行上拼接，axis=1在列上拼接

    adgroup_id  cate_id  campaign_id  customer     brand  price
0        63133     6406        83237         1   95471.0  170.0
1       313401     6406        83237         1   87331.0  199.0
2       248909      392        83237         1   32233.0   38.0
3       208458      392        83237         1  174374.0  139.0
10       23236     5953       395195        13       NaN  368.0
11      300556     5953       395195        13       NaN  639.0
12       92560     5953       395195        13       NaN  368.0
13      590965     4284        28145        14  454237.0  249.0
14      529913     4284        70206        14       NaN  249.0

In [26]:
pd.concat([df[:4], df[10:15]], axis=1)    # 把index相同的拼接成一行

,adgroup_id,cate_id,campaign_id,customer,brand,price,adgroup_id,cate_id,campaign_id,customer,brand,price
0,63133.0,6406.0,83237.0,1.0,95471.0,170.0,NaN,NaN,NaN,NaN,NaN,NaN
1,313401.0,6406.0,83237.0,1.0,87331.0,199.0,NaN,NaN,NaN,NaN,NaN,NaN
2,248909.0,392.0,83237.0,1.0,32233.0,38.0,NaN,NaN,NaN,NaN,NaN,NaN
3,208458.0,392.0,83237.0,1.0,174374.0,139.0,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,23236.0,5953.0,395195.0,13.0,NaN,368.0
11,NaN,NaN,NaN,NaN,NaN,NaN,300556.0,5953.0,395195.0,13.0,NaN,639.0
12,NaN,NaN,NaN,NaN,NaN,NaN,92560.0,5953.0,395195.0,13.0,NaN,368.0
13,NaN,NaN,NaN,NaN,NaN,NaN,590965.0,4284.0,28145.0,14.0,454237.0,249.0
14,NaN,NaN,NaN,NaN,NaN,NaN,529913.0,4284.0,70206.0,14.0,NaN,249.0

In [27]:
df6 = pd.concat([df[:4], df[10:15].reset_index(drop=True)], axis=1)

In [28]:
df6

,adgroup_id,cate_id,campaign_id,customer,brand,price,adgroup_id,cate_id,campaign_id,customer,brand,price
0,63133.0,6406.0,83237.0,1.0,95471.0,170.0,23236,5953,395195,13,NaN,368.0
1,313401.0,6406.0,83237.0,1.0,87331.0,199.0,300556,5953,395195,13,NaN,639.0
2,248909.0,392.0,83237.0,1.0,32233.0,38.0,92560,5953,395195,13,NaN,368.0
3,208458.0,392.0,83237.0,1.0,174374.0,139.0,590965,4284,28145,14,454237.0,249.0
4,NaN,NaN,NaN,NaN,NaN,NaN,529913,4284,70206,14,NaN,249.0

In [29]:
df6.columns

Index(['adgroup_id', 'cate_id', 'campaign_id', 'customer', 'brand', 'price',
       'adgroup_id', 'cate_id', 'campaign_id', 'customer', 'brand', 'price'],
      dtype='object')

In [30]:
df6['cate_id']

   cate_id  cate_id
0   6406.0     5953
1   6406.0     5953
2    392.0     5953
3    392.0     4284
4      NaN     4284

### 缺失值（Missing Value）处理

In [31]:
df.shape

(846811, 6)

In [32]:
df.dropna().shape    # 丢弃NaN值

(600481, 6)

In [33]:
df.fillna(0).head(10)    # 将NaN填充成固定值

   adgroup_id  cate_id  campaign_id  customer     brand   price
0       63133     6406        83237         1   95471.0  170.00
1      313401     6406        83237         1   87331.0  199.00
2      248909      392        83237         1   32233.0   38.00
3      208458      392        83237         1  174374.0  139.00
4      110847     7211       135256         2  145952.0   32.99
5      607788     6261       387991         6  207800.0  199.00
6      375706     4520       387991         6       0.0   99.00
7       11115     7213       139747         9  186847.0   33.00
8       24484     7207       139744         9  186847.0   19.00
9       28589     5953       395195        13       0.0  428.00

In [34]:
df.fillna(df['brand'].mean()).head(10)    # 使用brand均值填充

   adgroup_id  cate_id  campaign_id  customer          brand   price
0       63133     6406        83237         1   95471.000000  170.00
1      313401     6406        83237         1   87331.000000  199.00
2      248909      392        83237         1   32233.000000   38.00
3      208458      392        83237         1  174374.000000  139.00
4      110847     7211       135256         2  145952.000000   32.99
5      607788     6261       387991         6  207800.000000  199.00
6      375706     4520       387991         6  229254.422596   99.00
7       11115     7213       139747         9  186847.000000   33.00
8       24484     7207       139744         9  186847.000000   19.00
9       28589     5953       395195        13  229254.422596  428.00

In [35]:
df.fillna(method='ffill').head(10)    # 将NaN填充成前一个值

   adgroup_id  cate_id  campaign_id  customer     brand   price
0       63133     6406        83237         1   95471.0  170.00
1      313401     6406        83237         1   87331.0  199.00
2      248909      392        83237         1   32233.0   38.00
3      208458      392        83237         1  174374.0  139.00
4      110847     7211       135256         2  145952.0   32.99
5      607788     6261       387991         6  207800.0  199.00
6      375706     4520       387991         6  207800.0   99.00
7       11115     7213       139747         9  186847.0   33.00
8       24484     7207       139744         9  186847.0   19.00
9       28589     5953       395195        13  186847.0  428.00

### 异常值 / 离群值（Outlier Data）处理

In [36]:
price_des = df['price'].describe()
price_des

count    8.468110e+05
mean     1.838867e+03
std      3.108877e+05
min      1.000000e-02
25%      4.900000e+01
50%      1.390000e+02
75%      3.520000e+02
max      1.000000e+08
Name: price, dtype: float64

In [37]:
valid_max = price_des['50%'] + 3 * (price_des['75%'] - price_des['50%'])
valid_min = price_des['50%'] - 3 * (price_des['50%'] - price_des['25%'])
df['price'] = df['price'].clip(valid_min, valid_max)    # 把异常值变为边界值
df['price'].describe()

count    846811.000000
mean        243.996387
std         253.800315
min           0.010000
25%          49.000000
50%         139.000000
75%         352.000000
max         778.000000
Name: price, dtype: float64